p.144

[mpg데이터를 이용해 분석 문제를 해결]

In [36]:
# 그래프를 만들 때 사용할 mpg 데이터 불러오기
import pandas as pd
mpg = pd.read_csv('D:/WE_IT/doit/bookdata/mpg.csv')

Q1. 자동차 배기량에 따라 고속도로 연비가 다른지 알아보려고 합니다. displ(배기량)이 4이하인 자동차와 5이상인 자동차 중 어떤 자동차의 hwy(고속도로 연비)평균이 더 높은지 알아보세요.

In [37]:
mpg_a = mpg.query('displ <= 4')        # displ이 4 이하 추출
mpg_b = mpg.query('displ >= 5')        # displ이 5 이상 추출

print(mpg_a['hwy'].mean())    # displ이 4 이하의 hwy 평균
print(mpg_b['hwy'].mean())    # displ이 5 이상의 hwy 평균

25.96319018404908
18.07894736842105

Q2. 자동차 제조 회사에 따라 도시 연비가 어떻게 다른지 알아보려고 합니다. 'audi'와 'toyota' 중 어느 manufacturer의 cty평균이 더 높은지 알아보세요.

In [38]:
mpg_audi = mpg.query('manufacturer == "audi"')        # audi 추출
mpg_toyota = mpg.query('manufacturer == "toyota"')    # toyota 추출

print(mpg_audi['cty'].mean())      # audi의 cty 평균
print(mpg_toyota['cty'].mean())    # toyota의 cty 평균

17.61111111111111
18.529411764705884

Q3. 'chevrolet', 'ford', 'honda' 자동차의 고속도로 연비 평균을 알아보려고 합니다. 세 회사의 데이터를 추출한 다음 hwy 전체 평균을 구해 보세요.

In [39]:
# manufacturer가 chevrolet, ford, honda에 해당하면 추출 (in과 []이용)
mpg_three = mpg.query('manufacturer in ["chevrolet", "ford", "honda"]')
mpg_three['hwy'].mean()

22.50943396226415

p.150

Q1. mpg 데이터는 11개 변수로 구성됩니다. 이 중 일부만 추출해 분석에 활용하려고 합니다. mpg 데이터에서 category(자동차 종류), cty(도시 연비) 변수를 추출해 새로운 데이터를 만드세요. 새로 만든 데이터의 일부를 출력해 두 변수로만 구성되어 있는지 확인하세요.

In [40]:
mpg_new = mpg[['category', 'cty']]     # category, cty 추출
mpg_new.head()                         # 일부를 출력하여 두 변수로만 구성되어 있는지 확인

  category  cty
0  compact   18
1  compact   21
2  compact   20
3  compact   21
4  compact   16

Q2. 자동차 종류에 따라 도시 연비가 어떻게 다른지 알아보려고 합니다. 앞에서 추출한 데이터를 이용해 category(자동차 종류)가 'suv'인 자동차와 'compact'인 자동차 중 어떤 자동차의 cty(도시 연비)평균이 더 높은지 알아보세요.

In [41]:
# suv의 cty 평균
print(mpg_new.query('category == "suv"')['cty'].mean())

# compact의 cty 평균
print(mpg_new.query('category == "compact"')['cty'].mean())

13.5
20.127659574468087

p.153

Q1. 'audi'에서 생산한 자동차 중에 어떤 자동차 모델의 hwy(고속도로 연비)가 높은지 알아보려고 합니다. 'audi'에서 생산한 자동차 중 hwy가 1~5위에 해당하는 자동차의 데이터를 출력하세요.

In [42]:
mpg.query('manufacturer == "audi"') \
   .sort_values('hwy', ascending = False) \
   .head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
9,audi,a4 quattro,2.0,2008,4,manual(m6),4,20,28,p,compact

p.158

Q1. mpg 데이터 복사본을 만들고, cty와 hwy를 더한 '합산 연비 변수'를 추가하세요.

In [43]:
# mpg 복사본 만들기
mpg_copy = mpg.copy()

# 합산 연비 변수 추가 (pandas 구문 하나로 합쳐쓰는게 아닐 때는 mpg_copy = ~~~~이렇게 써줘야 함))
mpg_copy = mpg_copy.assign(total = mpg_copy['cty'] + mpg_copy['hwy'])

Q2. 앞에서 만든 '합산 연비 변수'를 2로 나눠 '평균 연비 변수'를 추가하세요.

In [44]:
# 평균 연비 변수 추가
mpg_copy = mpg_copy.assign(mean = mpg_copy['total'] / 2)

Q3. '평균 연비 변수'가 가장 높은 자동차 3종의 데이터를 출력하세요.

In [45]:
# 평균 연비 변수인 mean 기준으로 내림차순 정렬후, 상위 3행 출력
mpg_copy.sort_values('mean', ascending = False).head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

Q4. 1~3번 문제를 해결할 수 있는 하나로 연결된 pandas 구문을 만들어 실행해 보세요. 데이터는 복사본 대신 mpg 원본을 이용하세요.

In [46]:
mpg.assign(total = lambda x : x['cty'] + x['hwy'],
           mean = lambda x : x['total'] / 2) \
    .sort_values('mean',ascending = False) \
    .head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

p.166

Q1. mpg 데이터의 category는 자동차를 특징에 따라 'suv', 'compact' 등 일곱 종류로 분류한 변수입니다. 어떤 차종의 도시 연비가 높은지 비교해 보려고 합니다. cagegory별 cty 평균을 구해 보세요.

In [47]:
mpg.groupby('category') \
   .agg(mean_cty = ('cty', 'mean'))

             mean_cty
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

Q2. 앞 문제의 출력 결과는 cagegory 값 알파벳순으로 정렬되어 있습니다. 어떤 차종의 도시 연비가 높은지 쉽게 알아볼 수 있도록 cty 평균이 높은 순으로 정렬해 출력하세요.

In [48]:
mpg.groupby('category') \
   .agg(mean_cty = ('cty', 'mean')) \
   .sort_values('mean_cty', ascending = False)

             mean_cty
category
subcompact  20.371429
compact     20.127660
midsize     18.756098
minivan     15.818182
2seater     15.400000
suv         13.500000
pickup      13.000000

Q3. '어떤 회사 자동차의 hwy(고속도로 연비)가 가장 높은지 알아보려고 합니다. hwy 평균이 가장 높은 세 곳을 출력하세요.

In [49]:
mpg.groupby('manufacturer') \
   .agg(mean_hwy = ('hwy', 'mean')) \
   .sort_values('mean_hwy', ascending = False) \
   .head(3)

               mean_hwy
manufacturer
honda         32.555556
volkswagen    29.222222
hyundai       26.857143

Q4. 어떤 회사에서 'compact' 차종을 가장 많이 생산하는지 알아보려고 합니다. 회사별 'compact' 차종 수를 내림차순으로 정렬해 출력하세요.

In [50]:
mpg.query('category == "compact"') \
   .groupby('manufacturer') \
   .agg(n = ('manufacturer', 'count')) \
   .sort_values('n', ascending = False)

               n
manufacturer
audi          15
volkswagen    14
toyota        12
subaru         4
nissan         2

p.173

우선 연료와 가격으로 구성된 데이터 프레임을 만들기

In [51]:
fuel = pd.DataFrame({'fl'        : ['c', 'd', 'e', 'p', 'r'],
                     'price_fl'  : [2.35, 2.38, 2.11, 2.76, 2.22]})
fuel

  fl  price_fl
0  c      2.35
1  d      2.38
2  e      2.11
3  p      2.76
4  r      2.22

Q1. mpg 데이터에는 연료 종류를 나타낸 fl 변수는 있지만 연료 가격을 나타낸 변수는 없습니다. 앞에서 만든 fuel 데이터를 이용해 mpg 데이터에 price_fl(연료 가격)변수를 추가하세요.

In [52]:
# mpg에 연료 가격 변수 추가
mpg = pd.merge(mpg, fuel, how = 'left', on = 'fl')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,price_fl
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,2.76
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,2.76
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,2.76
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,2.76
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,2.76
...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,2.76
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,2.76
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,2.76
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,2.76
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,2.76

Q2. 연료 가격 변수가 잘 추가됏는지 확인하기 위해 model, fl, price_fl 변수를 추출해 앞부분 5행을 출력해 보세요.

In [53]:
# model, fl, price_fl 변수를 추출해 앞부분 5행을 출력
mpg[['model', 'fl', 'price_fl']].head()

  model fl  price_fl
0    a4  p      2.76
1    a4  p      2.76
2    a4  p      2.76
3    a4  p      2.76
4    a4  p      2.76

p.176

[midwest데이터를 이용해 분석 문제를 해결]

In [54]:
midwest = pd.read_csv('D:/WE_IT/doit/bookdata/midwest.csv')

Q1. popadults는 해당 지역의 성인 인구, poptotal은 전체 인구를 나타냅니다. midwest 데이터에 '전체 인구 대비 미성년 인구 백분율' 변수를 추가하세요.

In [55]:
# midwest에 백분율 변수 추가
midwest['ratio'] = (midwest['poptotal'] - midwest['popadults']) / midwest['poptotal'] * 100

Q2. 미셩년 인구 백분율이 가장 높은 상위 5개 county(지역)의 미셩년 인구 백분율을 출력하세요.

In [57]:
# ratio 내림차순 정렬후 상위 5행 추출 후 변수 추출
midwest.sort_values('ratio', ascending = False) \
       .head() \
       [['county', 'ratio']]

        county      ratio
230   ISABELLA  51.501172
404  MENOMINEE  50.591260
281     ATHENS  49.320727
247    MECOSTA  49.059183
154     MONROE  47.358182

Q3. 분류표의 기준에 따라 미셩년 비율 등급 변수를 추가하고, 각 등급에 몇 개의 지역이 있는지 알아보세요.

In [59]:
import numpy as np 

# midwest에 grade 변수 추가
midwest['grade'] = np.where(midwest['ratio'] >= 40, 'large',
                   np.where(midwest['ratio'] >= 30, 'middle', 'small'))

In [60]:
midwest.groupby('grade') \
       .agg(n = ('grade', 'count'))

          n
grade
large    32
middle  396
small     9

In [62]:
# 책에 있는 다른 방법
midwest['grade'].value_counts()

grade
middle    396
large      32
small       9
Name: count, dtype: int64

Q4. popasian은 해당 지역의 아시아인 인구를 나타냅니다. '전체 인구 대비 아시아인 인구 백분율'변수를 추가하고 하위 10개 지역의 state(주), county(지역), 아시아인 인구 백분율을 출력하세요.

In [66]:
# 백분율 변수 추가 후 내림차순 정렬 후 상위 10행 출력 후 변수 추출
midwest['ratio_asian'] = (midwest['popasian'] / midwest['poptotal'] * 100)
midwest.sort_values('ratio_asian') \
       .head(10) \
       [['state', 'county', 'ratio_asian']]
# 한 줄로 다 작성하려면 첫째 줄을 .assign(ratio_asian = midwest['popasian'] / midwest['poptotal'] * 100) 으로 바꾸면 됨

    state     county  ratio_asian
404    WI  MENOMINEE     0.000000
105    IN     BENTON     0.010592
109    IN    CARROLL     0.015950
358    OH     VINTON     0.027032
390    WI       IRON     0.032504
85     IL      SCOTT     0.053154
112    IN       CLAY     0.060716
261    MI     OSCODA     0.063759
340    OH      PERRY     0.066546
73     IL      PIATT     0.070749